Revit 2027 API
LightGroup.RemoveLight Method
 Remove the given light instance from the set of light instances in this group
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveLight(
	ElementId lightId
)
Public Sub RemoveLight (
	lightId As ElementId
)
public:
void RemoveLight(
	ElementId^ lightId
)
member RemoveLight :
        lightId : ElementId -> unit
Parameters
lightId ElementId
 The light instance to remove
Exceptions
Exception | Condition
ArgumentException |  The light instance is not in this LightGroup
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace